app/controllers/movies_controller.rb

    def index

      @@visitCount +=1;
      @instanceCount=@@visitCount
      @movParam=params[:sort]
      @all_ratings=Movie.ratingRetriver
      logger.debug " hash: #{params[:sort].inspect}"


      if(params[:ratings])
        #@movies = Movie.where("rating IN (?)", params[:ratings].keys).order(params[:sort])
        @movies=Movie.with_ratings(params[:ratings].keys)
        @is_rating_present=params[:ratings]
        #logger.debug " hash: #{@instanceCount.inspect}"

      else
        @movies = Movie.order(params[:sort])
---
SELECT "movies".* FROM "movies" WHERE (rating IN ('PG-13')) ORDER BY release_date